*** Roadmap

New item on roadmap is 0.3: controller support.

SDL2 doesn't detect my gamepad on Linux, and I don't know why. Take
the following program:

#+NAME: count_joystick_sdl1.2.c
#+BEGIN_SRC C :includes (list '<stdio.h> '<SDL/SDL.h>) :flags -I/usr/include/SDL -D_GNU_SOURCE=1 -D_REENTRANT -L/usr/lib -lSDL -lpthread
  SDL_Init(SDL_INIT_EVERYTHING);
  printf("%d\n", SDL_NumJoysticks());
#+END_SRC

#+RESULTS: count_joystick_sdl1.2.c
: 1

Compile it and link it against SDL 1.2. Run it with a working gamepad
attached (here my XBOX 360 Controller): the output is "1" (it's
configured to be run with Org-Babel, just hit C-c C-c and confirm to
run it).

Now just change the include to <SDL2/SDL.h> and link it against SDL2
(the part of the API used in the code hasn't changed so it's
compatible). Run it in the same conditions: the output is "0".

#+NAME: count_joystick_sdl2.c
#+BEGIN_SRC C :includes (list '<stdio.h> '<SDL2/SDL.h>) :flags -I/usr/include/SDL2 -D_GNU_SOURCE=1 -D_REENTRANT -L/usr/lib -lSDL2 -lpthread
  SDL_Init(SDL_INIT_EVERYTHING);
  printf("%d\n", SDL_NumJoysticks());
#+END_SRC

#+RESULTS: count_joystick_sdl2.c
: 0

I've looked up the Internet for clues, and it seems people have it
working on their Linux so I'm out of ideas. I could just downgrade the
whole project to SDL 1.2 but it feels backwards (plus I'd lose 2D
acceleration which was a must).

**** Wed Oct 30 17:21:29 CET 2013

I've compiled SDL2.0.1 from source and run test/testjoystick and it
still fails. I really think there's a bug to be reported here, I might
do it later.

I didn't do it right away because I wanted to compare with
testjoystick from SDL-1.2.15 but building it from source fails with
the following error:

#+BEGIN_EXAMPLE
./src/video/x11/SDL_x11sym.h:168:17: error: conflicting types for ‘_XData32’
 SDL_X11_SYM(int,_XData32,(Display *dpy,register long *data,unsigned len),(dpy,data,len),return)
                 ^
./src/video/x11/SDL_x11dyn.c:95:5: note: in definition of macro ‘SDL_X11_SYM’
  rc fn params { ret p##fn args ; }
     ^
In file included from ./src/video/x11/SDL_x11dyn.h:34:0,
                 from ./src/video/x11/SDL_x11dyn.c:26:
/usr/include/X11/Xlibint.h:568:12: note: previous declaration of ‘_XData32’ was here
 extern int _XData32(
            ^
#+END_EXAMPLE

Note about this: Arch patches this file so it's either a known
upstream issue or something introduced on the distro level.

*** Other
**** Customizable fighter speed > 1

Allows to increase the delay (better for the CPU).

**** Preload textures

Currently we rebuild the textures from the PNGs each time they're
modified.  It's inefficient (whatever overhead MagickWand may add,
it's fine as long as it's during init; now it's while playing) and
probably introduces a mem leak (I'm not sure what happens with the
previous SDL_Textures).

**** Use SDL_Image instead of MagickWand

It should work and that'd make one less dependency.
